20230823065430-point_to_point_protocol_ppp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 09:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Point-to Point Protocol (PPP)</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Point-to Point Protocol (PPP)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org992c640">1. Configuration</a>
<ul>
<li><a href="#orgd967d0a">1.1. Multilink</a></li>
<li><a href="#org844cd30">1.2. Compression</a></li>
<li><a href="#orge99de8f">1.3. Authentication</a></li>
<li><a href="#orgfbd36df">1.4. Password Authentication Protocol (PAP)</a></li>
<li><a href="#org1fb6256">1.5. Challenge Handshake Authentication Protocol (CHAP)</a></li>
<li><a href="#orgd5705f1">1.6. Error detection includes Frame Check Sequence (FCS) and looped link detection.</a>
<ul>
<li><a href="#orgde84d33">1.6.1. Frame Check Sequence (FCS)</a></li>
<li><a href="#orgdfd78dd">1.6.2. Looped link detection</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
A byte-oriented protocol broadly used for high-traffic data transmissions.
</p>

<p>
PPP functions at the <a href="20230820072332-data_link_layer.html#ID-a6d3f0e4-6871-401d-acea-0a58e4b6891a">2. Data Link Layer</a>, which transmits data between two devices on the same network.
</p>

<p>
PPP is strictly point-to-point, so frames can only go to the intended destination.
</p>

<p>
PPP is designed to link devices, so the endpoints do not need to be the same vendor to work.
</p>

<div id="outline-container-org992c640" class="outline-2">
<h2 id="org992c640"><span class="section-number-2">1.</span> Configuration</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd967d0a" class="outline-3">
<h3 id="orgd967d0a"><span class="section-number-3">1.1.</span> Multilink</h3>
<div class="outline-text-3" id="text-1-1">
<p>
spreading traffic across multiple distinct PPP connections.
</p>
</div>
</div>

<div id="outline-container-org844cd30" class="outline-3">
<h3 id="org844cd30"><span class="section-number-3">1.2.</span> Compression</h3>
<div class="outline-text-3" id="text-1-2">
<p>
increases throughput by reducing the amount of data in the frame.
</p>
</div>
</div>

<div id="outline-container-orge99de8f" class="outline-3">
<h3 id="orge99de8f"><span class="section-number-3">1.3.</span> Authentication</h3>
<div class="outline-text-3" id="text-1-3">
<p>
occurs when connected devices exchange authentication messages using one of two methods:
</p>
</div>
</div>

<div id="outline-container-orgfbd36df" class="outline-3">
<h3 id="orgfbd36df"><span class="section-number-3">1.4.</span> <a href="20230823070315-password_authentication_protocol_pap.html#ID-a8d5b07d-23ae-4384-8a67-75a14e05bd65">Password Authentication Protocol (PAP)</a></h3>
</div>

<div id="outline-container-org1fb6256" class="outline-3">
<h3 id="org1fb6256"><span class="section-number-3">1.5.</span> <a href="20230823070913-challenge_handshake_authentication_protocol_chap.html#ID-a4033b5f-7afd-4fb7-ac05-1ebf5d21e9fe">Challenge Handshake Authentication Protocol (CHAP)</a></h3>
</div>

<div id="outline-container-orgd5705f1" class="outline-3">
<h3 id="orgd5705f1"><span class="section-number-3">1.6.</span> Error detection includes Frame Check Sequence (FCS) and looped link detection.</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-orgde84d33" class="outline-4">
<h4 id="orgde84d33"><span class="section-number-4">1.6.1.</span> Frame Check Sequence (FCS)</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
A number included in the frame calculated over:
</p>
<ul class="org-ul">
<li>the Address</li>
<li>Control</li>
<li>Protocol</li>
<li>Information</li>
<li>Padding fields</li>
</ul>

<p>
Used to determine if there has been data loss during transmission.
</p>
</div>
</div>

<div id="outline-container-orgdfd78dd" class="outline-4">
<h4 id="orgdfd78dd"><span class="section-number-4">1.6.2.</span> Looped link detection</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
PPP detects looped links using magic numbers.
</p>

<p>
A magic number is generated randomly at each end of the connection, so when a looped message is received, the device checks the magic number against its own.
</p>

<p>
If the line is looped, the number will match the sender's magic number, and the frame is discarded.
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
